import React from 'react'
import {FaBars} from 'react-icons/fa'
import {Nav,NavbarContainer,NavbarLogo, MobileIcon,NavMenu,NavItem,NavLinks,NavBtn,NavBtnLink} from './NavbarElements'
import {animateScroll as scroll} from 'react-scroll'

const toggleHome = () => {
    scroll.scrollToTop();
}
const Navbar = ({toggle}) => {
    return (
        <>
        <Nav>
        <NavbarContainer>
            <NavbarLogo to = '/' onClick = {toggleHome} className = "navbar-logo">
                <svg width="163" height="76" viewBox="0 0 163 76" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <rect x="1.40918" width="160.886" height="76" rx="10" fill="#78C4EB"/>
                    <path d="M26.3042 37.8643H45.2139" stroke="white" stroke-width="2"/>
                    <path d="M26.3054 12.4857L26.3054 64.6" stroke="white" stroke-width="2"/>
                    <path d="M137.399 12.4857L137.399 64.6" stroke="white" stroke-width="2"/>
                    <path d="M1.4043 38.4071H4.23251" stroke="white" stroke-width="2"/>
                    <path d="M159.477 38H162.305" stroke="white" stroke-width="2"/>
                    <path d="M118.609 38H137.399" stroke="white" stroke-width="2"/>
                    <path d="M0 12.4857H162.295" stroke="white" stroke-width="2"/>
                    <path d="M0.70459 64.6H163" stroke="white" stroke-width="2"/>
                    <path d="M53.9951 36.22H54.2951L58.2151 30.8H62.6151L57.4751 37.66L63.0751 45H58.7351L54.6351 39.76H53.9951V45H50.1151V30.8H53.9951V36.22ZM66.9837 45.14C66.8237 45.14 66.637 45.1267 66.4237 45.1C66.2103 45.0733 65.9837 45.0267 65.7437 44.96C65.5037 44.8933 65.2703 44.8133 65.0437 44.72C64.817 44.6133 64.617 44.4867 64.4437 44.34L65.2637 41.16C65.277 41.1867 65.3237 41.2333 65.4037 41.3C65.4837 41.3667 65.5837 41.4333 65.7037 41.5C65.8237 41.5667 65.957 41.6267 66.1037 41.68C66.2503 41.7333 66.4103 41.76 66.5837 41.76C66.877 41.76 67.1237 41.6867 67.3237 41.54C67.5237 41.3933 67.6503 41.1867 67.7037 40.92L62.4437 30.8H66.7437L69.4437 37.14L71.9237 30.8H76.0237L71.0237 41.6C70.7303 42.24 70.4437 42.7867 70.1637 43.24C69.897 43.68 69.6037 44.04 69.2837 44.32C68.977 44.6 68.637 44.8067 68.2637 44.94C67.9037 45.0733 67.477 45.14 66.9837 45.14ZM76.951 45V30.8H83.071C83.7643 30.8 84.4043 30.9467 84.991 31.24C85.5777 31.52 86.0777 31.8933 86.491 32.36C86.9177 32.8133 87.251 33.34 87.491 33.94C87.731 34.5267 87.851 35.12 87.851 35.72C87.851 36.3467 87.7377 36.96 87.511 37.56C87.2843 38.1467 86.9643 38.6733 86.551 39.14C86.151 39.5933 85.6577 39.96 85.071 40.24C84.4977 40.5067 83.8643 40.64 83.171 40.64H80.851V45H76.951ZM80.851 37.24H82.911C83.151 37.24 83.371 37.1333 83.571 36.92C83.7843 36.6933 83.891 36.2933 83.891 35.72C83.891 35.1333 83.771 34.7333 83.531 34.52C83.291 34.3067 83.051 34.2 82.811 34.2H80.851V37.24ZM89.4901 30.8H93.3901V35.5H95.7101C96.5101 35.5 97.2234 35.6067 97.8501 35.82C98.4901 36.0333 99.0301 36.3467 99.4701 36.76C99.9234 37.16 100.27 37.6467 100.51 38.22C100.75 38.7933 100.87 39.44 100.87 40.16C100.87 41.6667 100.43 42.8533 99.5501 43.72C98.6701 44.5733 97.4567 45 95.9101 45H89.4901V30.8ZM93.3901 41.72H95.3501C95.8567 41.72 96.2367 41.58 96.4901 41.3C96.7567 41.0067 96.8901 40.6133 96.8901 40.12C96.8901 39.6933 96.7567 39.3267 96.4901 39.02C96.2367 38.7 95.8567 38.54 95.3501 38.54H93.3901V41.72ZM109.68 45V40.04H108.64L105.52 45H101.34L104.76 39.6C103.987 39.24 103.38 38.7067 102.94 38C102.5 37.28 102.28 36.42 102.28 35.42C102.28 34.74 102.4 34.12 102.64 33.56C102.88 33 103.207 32.5133 103.62 32.1C104.047 31.6867 104.554 31.3667 105.14 31.14C105.727 30.9133 106.367 30.8 107.06 30.8H113.58V45H109.68ZM109.68 34.1H107.62C107.46 34.1 107.294 34.12 107.12 34.16C106.96 34.2 106.814 34.2733 106.68 34.38C106.56 34.4733 106.454 34.6067 106.36 34.78C106.28 34.9533 106.24 35.1667 106.24 35.42C106.24 35.6867 106.28 35.9067 106.36 36.08C106.44 36.24 106.54 36.3733 106.66 36.48C106.794 36.5733 106.94 36.64 107.1 36.68C107.274 36.72 107.447 36.74 107.62 36.74H109.68V34.1Z" fill="white"/>
                </svg>
            </NavbarLogo>
            <MobileIcon onClick = {toggle}>
                <FaBars />
            </MobileIcon>
            <NavMenu>
                <NavItem>
                    <NavLinks to="about" smooth = {true} duration = {500} spy = {true} exact = 'true' offset = {-80}> 
                        О нас
                    </NavLinks>
                    <NavLinks to="training" smooth = {true} duration = {500} spy = {true} exact = 'true' offset = {-80}>
                        Тренировки
                    </NavLinks>
                    <NavLinks to="team" smooth = {true} duration = {500} spy = {true} exact = 'true' offset = {-80}>
                        Команда
                    </NavLinks>
                    <NavLinks to="courts" smooth = {true} duration = {500} spy = {true} exact = 'true' offset = {-80}>
                        Корты
                    </NavLinks>
                    <NavLinks to="contacts" smooth = {true} duration = {500} spy = {true} exact = 'true' offset = {-80}>
                        Контакты
                    </NavLinks>
                </NavItem>
            </NavMenu>   
            <NavBtn>
                <NavBtnLink to='/signin'>
                    Войти 
                </NavBtnLink>
            </NavBtn>
        </NavbarContainer>
    </Nav>
    </>
    )
}

export default Navbar
